InformationRegisters/_РаботыЗаДень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>_РаботыЗаДень</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасыКлиенту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗагруженоСRM</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоНачисление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ВидыОбращенийТехподдержки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСервисДеск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef._ИсполнениеЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/_РаботыЗаДень/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    
    Если не ЗначениеЗаполнено(Запись.КодСтроки) тогда
        Запись.КодСтроки = новый УникальныйИдентификатор;
    КонецЕсли;
КонецПроцедуры


//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//    
//    Если Запись.Заявка <> Запись.ИсходныйКлючЗаписи.Заявка и не Запись.ИсходныйКлючЗаписи.Заявка.Пустая() тогда
//        ТекущийОбъект.ДополнительныеСвойства.Вставить("ДокументСтарый",Запись.ИсходныйКлючЗаписи.Заявка);    
//    КонецЕсли;
//    
//КонецПроцедуры


//&НаСервере
//Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
//    мас = Новый  Массив;
//    
//    мас.Добавить(ТекущийОбъект.Заявка);
//    
//    ФоновыеЗадания.Выполнить("_ОбщийМодульСервер.ПеренестиЧлВЗаявку", мас, новый УникальныйИдентификатор);
//    
//КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Параметры.Свойство("ДобавлениеСАРМ") и Запись.Задача.Пустая() тогда
        Элементы.Добавление.Видимость = Ложь;
    КонецЕсли;
    ДатаЗапрета = ДатаЗапретаРедактирования();
    
    Видимость();   // Элементы.Группа1.ТолькоПросмотр = РольДоступна("Полныеправа") или РольДоступна("_ИзменениеВыполненныхПроверенныхЗаявок");
    
КонецПроцедуры


&НаКлиенте
Процедура ЧасыПриИзменении(Элемент)
    ОкруглитьДоЧетвертиЧаса(Запись.Часы);
КонецПроцедуры



&НаКлиенте
Процедура ОбновитьВидимость(Элемент)
   Видимость();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
        
    Если  ЗначениеЗаполнено(ДатаЗапрета) и ТекущийОбъект.Дата <= ДатаЗапрета
        и не РольДоступна("_ИзменениеВыполненныхПроверенныхЗаявок")
        и не РольДоступна("Полныеправа") тогда
        ОбщегоНазначения.СообщитьПользователю(СтрШаблон("ЧЛ (%1, %2, %3 ) 
        |попадает под дату запрета !!!",ТекущийОбъект.Заявка,ТекущийОбъект.Дата, ТекущийОбъект.Описание),,,,Отказ);
    КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура Видимость()
    
    Если Параметры.Свойство("ДобавлениеСАРМ") и Запись.Задача.Пустая() тогда
        Элементы.Добавление.Видимость = Ложь;
    КонецЕсли;
    ДатаЗапрета = ДатаЗапретаРедактирования();
    
    Если (Запись.Заявка.Проверена 
        или ДатаЗапрета >= Запись.Дата
        или Запись.ЗагруженоСRM)
        и не РольДоступна("_ИзменениеВыполненныхПроверенныхЗаявок") 
        и не РольДоступна("Полныеправа") тогда
        ТолькоПросмотр = Истина;
    КонецЕсли;
    
    Элементы.ТехПод.Видимость           = Запись.Заявка.Техподдержка;
    Элементы.НомерСервисДеск.Видимость  = Запись.ВидОбращения = Справочники._ВидыОбращенийТехподдержки.Сервис_деск и Запись.Задача.Пустая();
    Элементы.Задача.Видимость           = не Запись.Задача.Пустая();
    Элементы.Задание.Видимость          = Запись.Задача.Пустая();
    Элементы.Задание_.Видимость          = не Запись.Задача.Пустая();
    
   // Элементы.Группа1.ТолькоПросмотр = РольДоступна("Полныеправа") или РольДоступна("_ИзменениеВыполненныхПроверенныхЗаявок");
    
КонецПроцедуры
